app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
      redirect_to @book, notice: 'Book was successfully created.'
    else
      @books = Book.all
---
INSERT INTO "books" ("body", "title", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "aaa"], ["title", "a"], ["created_at", "2020-04-01 03:41:03.062837"], ["updated_at", "2020-04-01 03:41:03.062837"]]
SELECT "books".* FROM "books"

  def update
    set_book
    if @book.update(book_params)
---
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "update_title_a"], ["body", "update_body_b"], ["updated_at", "2020-04-01 04:43:11.294554"], ["id", 1]]